<?xml version="1.0" ?><policyDefinitionResources revision="1.0" schemaVersion="1.0" xmlns="http://www.microsoft.com/GroupPolicy/PolicyDefinitions"><!--microsoft_edge version: 138.0.3351.95--><displayName/><description/><resources><stringTable><string id="WebView2LoaderOverrideSettings_group">Paramètres de remplacement du chargeur</string><string id="BrowserExecutableFolder">Configurer l’emplacement du dossier exécutable du navigateur</string><string id="BrowserExecutableFolder_Explain">Cette stratégie configure les applications WebView2 pour utiliser le runtime WebView2 dans le chemin d’accès spécifié. Le dossier doit contenir les fichiers suivants : msedgewebview2.exe, msedge.dll, etc.

Pour définir la valeur du chemin d’accès au dossier, fournissez un nom et une paire valeur. Attribuez à nom de la valeur l’ID de modèle utilisateur de l’application ou le nom du fichier exécutable. Vous pouvez utiliser le caractère générique « * » comme nom de valeur à appliquer à toutes les applications.

Exemple de valeur :

Name: *, Value: C:\Program Files\Microsoft Edge WebView2 Runtime Redistributable 85.0.541.0 x64</string><string id="BrowserExecutableFolderDesc">Configurer l’emplacement du dossier exécutable du navigateur</string><string id="ChannelSearchKind">Configurer le type de recherche du canal de publication WebView2</string><string id="ChannelSearchKind_Explain">Cette stratégie configure le type de recherche de canal pour les applications WebView2. Par défaut, le type de recherche de canal est 0, ce qui équivaut au type de recherche « Le plus stable » dans l’API WebView2 correspondante. Cela indique que la création d’un environnement WebView2 doit rechercher un canal de publication du plus stable au moins stable : WebView2 Runtime, Beta, Dev et Canary.

Pour inverser l’ordre de recherche par défaut et utiliser le type de recherche « Le moins stable », définissez cette stratégie sur la valeur 1.

Pour définir la valeur du type de recherche de canal, fournissez un nom de valeur et une paire de valeur. Définissez le nom de la valeur sur l’ID du modèle utilisateur de l’application ou le nom du fichier exécutable. Vous pouvez utiliser le caractère générique « * » comme nom de valeur à appliquer à toutes les applications.

Exemple de valeur :

Name: WebView2APISample.exe, Value: 1</string><string id="ChannelSearchKindDesc">Configurer le type de recherche du canal de publication WebView2</string><string id="ReleaseChannelPreference">Définition de la préférence d’ordre de recherche de canaux de publication (déconseillé)</string><string id="ReleaseChannelPreference_Explain">DÉCONSEILLÉ : cette stratégie est déconseillée. Elle est actuellement prise en charge, mais deviendra obsolète dans une prochaine version.

Cette stratégie est déconseillée en faveur de ChannelSearchKind, qui a la même fonctionnalité, et devient obsolète dans la version 124. L’ordre de recherche des canaux par défaut est WebView2 Runtime, Beta, Dev et Canary.

Pour annuler l’ordre de recherche par défaut, définissez cette stratégie sur la valeur 1.

Pour définir la valeur de la préférence de canal de publication, fournissez un nom de valeur et une paire de valeur. Définissez le nom de la valeur sur l’ID du modèle utilisateur de l’application ou le nom du fichier exécutable. Vous pouvez utiliser le caractère générique « * » comme nom de valeur à appliquer à toutes les applications.

Exemple de valeur :

Name: *, Value: 1</string><string id="ReleaseChannelPreferenceDesc">Définition de la préférence d’ordre de recherche de canaux de publication (déconseillé)</string><string id="ReleaseChannels">Configurer les canaux de publication WebView2</string><string id="ReleaseChannels_Explain">Cette stratégie configure les options de canal de publication pour les applications WebView2. Pour configurer ces options, définissez la valeur sur une chaîne d’entiers séparés par des virgules, qui correspondent aux valeurs « COREWEBVIEW2_RELEASE_CHANNELS » de l’API WebView2 correspondante. Ces valeurs sont : WebView2 Runtime (0), Beta (1), Dev (2) et Canary (3). Par défaut, la création d’environnement recherche les canaux du plus stable au moins stable, à l’aide du premier canal trouvé sur l’appareil. Lorsque « ReleaseChannels » est fourni, la création d’environnement recherche uniquement les canaux spécifiés dans l’ensemble. Par exemple, les valeurs « 0,2 » et « 2,0 » indiquent que la création d’environnement doit uniquement rechercher le canal développeurs et le WebView2 Runtime, à l’ordre de l’ordre indiqué par « ChannelSearchKind ». La création d’environnement tente d’interpréter chaque entier et traite toute entrée non valide comme le canal stable. Définissez « ChannelSearchKind » pour inverser l’ordre de recherche pour que la création d’environnement recherche d’abord la build la moins stable. Si « BrowserExecutableFolder » et « ReleaseChannels » sont tous les deux fournis, « BrowserExecutableFolder » est prioritaire, que le canal de « BrowserExecutableFolder » soit ou non inclus dans les « ReleaseChannels ».

Pour définir la valeur des canaux de publication, fournissez un nom de valeur et une paire de valeur. Définissez le nom de la valeur sur l’ID du modèle utilisateur de l’application ou le nom du fichier exécutable. Vous pouvez utiliser le caractère générique « * » comme nom de valeur à appliquer à toutes les applications.

Exemple de valeur :

Name: WebView2APISample.exe, Value: 0,1,2</string><string id="ReleaseChannelsDesc">Configurer les canaux de publication WebView2</string><string id="Network_group">Paramètres réseau</string><string id="AccessControlAllowMethodsInCORSPreflightSpecConformant">Rendre conforme Access-Control-Allow-Methods correspondant dans CORS prédéfinie conforme</string><string id="AccessControlAllowMethodsInCORSPreflightSpecConformant_Explain">Cette stratégie contrôle si les méthodes de demande sont mises en capitales lors de la mise en correspondance avec Access-Control-Allow-Methods en-têtes de réponse dans CORSpréversion.

Si vous désactivez cette stratégie, les méthodes de requête sont mises en majuscules. Il s’agit du comportement le ou avant Microsoft Edge 108.

Si vous activez ou ne configurez pas cette stratégie, les méthodes de requête ne sont pas mises en majuscules, sauf si la casse n’est pas mise en correspondance avec DELETE, GET, HEAD, OPTIONS, POSTou PUT.

Cela rejetterait fetch(url, {method: 'Foo'}) + &quot;Access-Control-Allow-Methods: FOO&quot; en-tête de réponse,
et accepterait fetch(url, {method: 'Foo'}) + &quot;Access-Control-Allow-Methods: Foo&quot; l’en-tête de réponse.

Remarque : les méthodes de requête &quot;post&quot; et &quot;put&quot; ne sont pas affectées, tandis que &quot;patch&quot; est affectée.

Cette stratégie est destinée à être temporaire et sera supprimée à l’avenir.</string><string id="BlockTruncatedCookies">Bloquer les cookies tronqués (obsolète)</string><string id="BlockTruncatedCookies_Explain">OBSOLÈTE : cette stratégie est obsolète et ne fonctionne pas après Microsoft Edge131.

Cette stratégie fournit une exclusion temporaire pour les modifications apportées à la façon dont Microsoft Edge gère les cookies définis via JavaScript qui contiennent certains caractères de contrôle (NULL, retour chariot et flux de ligne).
Auparavant, la présence de l’un de ces caractères dans une chaîne de cookie entraînerait sa troncation mais toujours définie.
À présent, la présence de ces caractères entraînera l’ignorée de l’ensemble de la chaîne de cookie.

Si vous activez ou ne configurez pas cette stratégie, le nouveau comportement est activé.

Si vous désactivez cette stratégie, l’ancien comportement est activé.

Cette stratégie est obsolète, car elle a été implémentée à l’origine en tant que mesure de sécurité en cas d’interruption, mais aucune n’a été signalée.</string><string id="ZstdContentEncodingEnabled">Activer la prise en charge de l’encodage de contenu zstd (obsolète)</string><string id="ZstdContentEncodingEnabled_Explain">OBSOLÈTE : cette stratégie est obsolète et ne fonctionne pas après Microsoft Edge137.

Cette stratégie contrôle si Microsoft Edge prend en charge l’encodage de contenu Zstandard (zstd).

Activé – Edge publie zstd dans l’en-tête de requête Accept-Encoding et peut décompresser les réponses encodées avec zstd.

Désactivé – Edge ne publie pas ou ne prend pas en charge l’encodage de contenu zstd.

Non configuré – le comportement par défaut consiste à activer la prise en charge de l’encodage de contenu zstd.

REMARQUE :
Cette stratégie a été rendue obsolète à partir de Microsoft Edge version 138, car Microsoft Edge prend désormais toujours en charge l’encodage de contenu zstd.</string><string id="ExperimentationAndConfigurationServiceControl">Contrôler la communication avec le service d’expérimentation et de configuration</string><string id="ExperimentationAndConfigurationServiceControl_Explain">Le service d'expérimentation et de configuration est utilisé pour déployer les charges utiles d'expérimentation et de configuration sur le client.

Les charges utiles d'expérimentation consistent en une liste de fonctions en début de développement que Microsoft Corporation active pour les tester et obtenir un retour d'information.

  Les données utiles de configuration consistent en une liste de paramètres recommandés que Microsoft Corporation souhaite déployer pour optimiser l'expérience utilisateur.

    Les données utiles de configuration peuvent également contenir une liste d'actions à entreprendre sur certains domaines pour des raisons de compatibilité. Par exemple, le navigateur peut remplacer la chaîne User Agent d'un site Web si ce dernier n'est pas compatible. Chacune de ces actions est censée être temporaire pendant que Microsoft Corporation tente de résoudre le problème avec le propriétaire du site.

     Si vous définissez cette stratégie sur « FullMode », la charge utile complète est téléchargée depuis le service d'expérimentation et de configuration. Cela inclut les charges utiles d'expérimentation et de configuration.

    Si vous définissez cette stratégie sur « ConfigurationsOnlyMode », seuls les fichiers utiles de configuration sont téléchargés.

     Si vous définissez cette stratégie sur &quot;RestrictedMode&quot;, la communication avec le service d'expérimentation et de configuration est complètement interrompue. Microsoft Corporation ne recommande pas ce paramètre.

     Si vous ne configurez pas cette stratégie sur un dispositif géré, le comportement sur les canaux Beta et Stable est le même que celui du 'ConfigurationsOnlyMode'. Sur les canaux Canary et Dev, le comportement est le même que celui du « FullMode ».

     Si vous ne configurez pas cette politique sur un dispositif non géré, le comportement est le même que celui du « FullMode ».

Mappage des options de stratégie :

* FullMode (2) = Récupérer les configurations et les expérimentations

* ConfigurationsOnlyMode (1) = Récupérer les configurations uniquement

* RestrictedMode (0) = Désactiver la communication avec le service d’expérimentation et de configuration

Utilisez les informations ci-dessus lors de la configuration de cette stratégie.</string><string id="ExperimentationAndConfigurationServiceControl_FullMode">Récupérer les configurations et les expérimentations</string><string id="ExperimentationAndConfigurationServiceControl_ConfigurationsOnlyMode">Récupérer les configurations uniquement</string><string id="ExperimentationAndConfigurationServiceControl_RestrictedMode">Désactiver la communication avec le service d’expérimentation et de configuration</string><string id="ForcePermissionPolicyUnloadDefaultEnabled">Contrôle si les gestionnaires d’événements unload peuvent être désactivés.</string><string id="ForcePermissionPolicyUnloadDefaultEnabled_Explain">unload les gestionnaires d’événements sont déconseillés. Leur déclenchement dépend de unload Permissions-Policy.
Actuellement, ils sont autorisés par la stratégie par défaut. À l’avenir, ils seront progressivement interdits par défaut et les sites devront les activer explicitement à l’aide des Permissions-Policy en-têtes.
Vous pouvez utiliser cette stratégie d’entreprise pour refuser cette désapprobation progressive en forçant la valeur par défaut à rester activée.

Les pages peuvent dépendre des gestionnaires d’événements unload pour enregistrer des données ou signaler la fin d’une session utilisateur au serveur.
Cette opération n’est pas recommandée, car elle n’est pas fiable et affecte les performances en bloquant l’utilisation de BackForwardCache.
Il existe des alternatives recommandées, mais l’événement unload a été utilisé depuis longtemps. Certaines applications peuvent encore s’appuyer sur elles.

Si vous désactivez cette stratégie ou ne la configurez pas, les gestionnaires d’événements unload seront progressivement déconseillés conformément au déploiement prévu de la désapprobation et les sites qui ne définissent pas l’en-tête Permissions-Policy cesseront de déclencher des événements de « déchargement ».

Si vous activez cette stratégie, alors les gestionnaires d’événements unload continueront à fonctionner par défaut.</string><string id="HttpAllowlist">Liste verte HTTP</string><string id="HttpAllowlist_Explain">La définition de la stratégie spécifie une liste de noms d'hôtes ou de modèles de noms d'hôtes (tels que « [*.]example.com ») qui ne seront pas mis à niveau vers HTTPS. Les organisations peuvent utiliser cette stratégie pour conserver l’accès aux serveurs qui ne prennent pas en charge HTTPS, sans avoir à désactiver &quot;AutomaticHttpsDefault&quot; ou &quot;HttpsUpgradesEnabled&quot;.

Les noms d'hôtes fournis doivent être canonisés : tous les IDN doivent être convertis dans leur format d'étiquette A et toutes les lettres ASCII doivent être en minuscules.

Les caractères génériques d'hôte généraux (c'est-à-dire « * » ou « [*] ») ne sont pas autorisés. Au lieu de cela, le mode HTTPS-First et les mises à niveau HTTPS doivent être explicitement désactivés via leurs stratégies spécifiques.

Remarque : cette stratégie ne s’applique pas aux mises à niveau HSTS.

Exemple de valeur :

testserver.example.com
[*.]example.org</string><string id="HttpAllowlistDesc">Liste verte HTTP</string><string id="NewBaseUrlInheritanceBehaviorAllowed">Autorise l’activation de la fonctionnalité NewBaseUrlInheritanceBehavior (obsolète)</string><string id="NewBaseUrlInheritanceBehaviorAllowed_Explain">OBSOLÈTE : cette stratégie est obsolète et ne fonctionne pas après Microsoft Edge135.

NewBaseUrlInheritanceBehavior est une Microsoft Edge fonctionnalité qui permet about:blank aux images et about:srcdoc aux images d’hériter de manière cohérente de leurs valeurs d’URL de base par le biais d’instantanés de l’URL de base de leur initiateur.

Si vous désactivez cette stratégie, elle empêche les utilisateurs ou Microsoft Edge les variantes d’activer NewBaseUrlInheritanceBehavior, si des problèmes de compatibilité sont détectés.

Si vous activez ou ne configurez pas cette stratégie, elle autorise l’activation de NewBaseUrlInheritanceBehavior.

La stratégie a été obsolète à partir de Microsoft Edge la version 136, mais la fonctionnalité NewBaseUrlInheritanceBehaviorAllowed a été supprimée dans Microsoft Edge la version 123.</string><string id="NewPDFReaderWebView2List">Activer le lecteur PDF intégré optimisé par Adobe Acrobat pour WebView2</string><string id="NewPDFReaderWebView2List_Explain">Cette stratégie configure les applications WebView2 pour qu'elles lancent la nouvelle version du lecteur PDF qui est alimentée par Adobe Acrobat's PDF reader. Le nouveau lecteur PDF garantit qu'il n'y a pas de perte de fonctionnalité et offre une expérience PDF améliorée. Cette expérience comprend un rendu plus riche, des performances améliorées, une sécurité renforcée pour le traitement des fichiers PDF et une plus grande accessibilité.

Si cette stratégie est spécifiée pour une application, il est possible qu'elle ait également un impact sur d'autres applications connexes. La politique est appliquée à tous les WebView2 qui partagent le même dossier de données utilisateur WebView2. Ces WebView2 peuvent potentiellement appartenir à plusieurs applications si ces applications, qui appartiennent probablement à la même famille de produits, sont conçues pour partager le même dossier de données utilisateur.

Utilisez une paire nom-valeur pour activer le nouveau lecteur PDF pour l'application. Définissez le nom comme étant l'ID du modèle d'utilisateur de l'application ou le nom du fichier exécutable. Vous pouvez utiliser le caractère générique &quot;*&quot; comme nom de valeur pour l'appliquer à toutes les applications. Définissez la valeur sur true pour activer le nouveau lecteur ou sur false pour utiliser le lecteur existant.

Si vous activez cette politique pour les applications WebView2 spécifiées, elles utiliseront le nouveau lecteur PDF propulsé par Adobe Acrobat pour ouvrir tous les fichiers PDF.

Si vous désactivez la politique pour les applications WebView2 spécifiées ou si vous ne la configurez pas, elles utiliseront le lecteur PDF existant pour ouvrir tous les fichiers PDF.

Exemple de valeur :

{&quot;name&quot;: &quot;app1.exe&quot;, &quot;value&quot;: true}
{&quot;name&quot;: &quot;app_id_for_app2&quot;, &quot;value&quot;: true}
{&quot;name&quot;: &quot;*&quot;, &quot;value&quot;: false}</string><string id="NewPDFReaderWebView2ListDesc">Activer le lecteur PDF intégré optimisé par Adobe Acrobat pour WebView2</string><string id="RSAKeyUsageForLocalAnchorsEnabled">Vérifier l'utilisation de la clé RSA pour les certificats de serveur émis par les ancres de confiance locales (obsolète)</string><string id="RSAKeyUsageForLocalAnchorsEnabled_Explain">OBSOLÈTE : cette stratégie est obsolète et ne fonctionne pas après Microsoft Edge135.

L’extension d’utilisation de la clé X.509 déclare comment la clé d’un certificat peut être
utilisée. Ces instructions permettent de s’assurer que les certificats ne sont pas utilisés dans un
contexte inattendu, ce qui protège contre une classe d’attaques inter-protocoles sur HTTPS et
d’autres protocoles. Les clients HTTPS doivent vérifier que les certificats de serveur correspondent aux
paramètres TLS de la connexion.

Début dans Microsoft Edge 124,cette
est toujours activé

Microsoft Edge 123 et versions antérieures ont le
comportement suivant :

Lorsque cette stratégie est activée,
Microsoft Edge effectuera cette vérification
de clé. Cela permet d’éviter les attaques par lesquelles un attaquant manipule le navigateur pour
lui faire interpréter une clé d’une manière non prévue par le propriétaire du certificat.

Lorsque cette stratégie est désactivée,
Microsoft Edge ignorera la vérification de cette clé dans
les connexions HTTPS qui négocient TLS 1.2 et utilisent un certificat RSA qui
est lié à une ancre d’approbation locale. Parmi les exemples d’ancres d’approbation locales, on compte
les certificats racines fournis par la stratégie ou installés par l’utilisateur. Dans tous les autres cas, la
vérification est effectuée indépendamment du paramètre de cette stratégie.

Si cette stratégie n’est pas configurée,
Microsoft Edge se comporte comme si la
stratégie est activée,

Cette stratégie permet aux administrateurs d’afficher un aperçu du comportement d’une
version ultérieure, ce qui active cette vérification par défaut. À ce stade, cette
stratégie reste temporairement disponible pour les administrateurs qui ont besoin de plus
de temps pour mettre à jour leurs certificats pour répondre aux nouvelles exigences d’utilisation des clés RSA.

Les connexions qui échouent à cette vérification échouent avec l’erreur
ERR_SSL_KEY_USAGE_INCOMPATIBLE. Les sites qui échouent avec cette erreur ont probablement un
certificat mal configuré. Les suites de chiffrement ECDHE_RSA modernes utilisent
l’option d’utilisation de clé « digitalSignature », tandis que les suites de chiffrement de déchiffrement RSA héritées
utilisent l’option d’utilisation de clé « keyEncipherment ». En cas d’doute, les administrateurs doivent
inclure les deux dans les certificats RSA destinés à HTTPS.

La stratégie a été obsolète à partir de Microsoft Edge version 136,
mais la vérification de clé a toujours été activée depuis Microsoft Edge version 124.</string><string id="SUPPORTED_WIN7_V97">Microsoft Edge version 97, Windows 7 ou version ultérieure</string><string id="SUPPORTED_WIN7_V116">Microsoft Edge version 116, Windows 7 ou version ultérieure</string><string id="SUPPORTED_WIN7_V118">Microsoft Edge version 118, Windows 7 ou version ultérieure</string><string id="SUPPORTED_WIN7_V87">Microsoft Edge version 87, Windows 7 ou version ultérieure</string><string id="SUPPORTED_WIN7_V121">Microsoft Edge version 121, Windows 7 ou version ultérieure</string><string id="SUPPORTED_WIN7_V123">Microsoft Edge version 123, Windows 7 ou version ultérieure</string><string id="SUPPORTED_WIN7_V125">Microsoft Edge version 125, Windows 7 ou version ultérieure</string><string id="OBSOLETE_WIN7_V123_V135">Microsoft Edge version 123-135, Windows 7 ou ultérieur</string><string id="OBSOLETE_WIN7_V125_V137">Microsoft Edge version 125-137, Windows 7 ou ultérieur</string><string id="OBSOLETE_WIN7_V123_V131">Microsoft Edge version 123-131, Windows 7 ou ultérieur</string><string id="microsoft_edge_webview2">Microsoft Edge WebView2</string><string id="microsoft_edge_webview2_recommended">Microsoft Edge WebView2 - Paramètres par défaut (les utilisateurs peuvent les modifier)</string></stringTable><presentationTable><presentation id="BrowserExecutableFolder"><listBox refId="BrowserExecutableFolderDesc">Définissez le nom de la valeur sur l’ID du modèle utilisateur de l’application ou le nom du fichier exécutable. Vous pouvez utiliser le caractère générique « * » comme nom de valeur à appliquer à toutes les applications.</listBox></presentation><presentation id="ChannelSearchKind"><listBox refId="ChannelSearchKindDesc">Définissez le nom de la valeur sur l’ID du modèle utilisateur de l’application ou le nom du fichier exécutable. Vous pouvez utiliser le caractère générique « * » comme nom de valeur à appliquer à toutes les applications.</listBox></presentation><presentation id="ReleaseChannelPreference"><listBox refId="ReleaseChannelPreferenceDesc">Définissez le nom de la valeur sur l’ID du modèle utilisateur de l’application ou le nom du fichier exécutable. Vous pouvez utiliser le caractère générique « * » comme nom de valeur à appliquer à toutes les applications.</listBox></presentation><presentation id="ReleaseChannels"><listBox refId="ReleaseChannelsDesc">Définissez le nom de la valeur sur l’ID du modèle utilisateur de l’application ou le nom du fichier exécutable. Vous pouvez utiliser le caractère générique « * » comme nom de valeur à appliquer à toutes les applications.</listBox></presentation><presentation id="AccessControlAllowMethodsInCORSPreflightSpecConformant"/><presentation id="BlockTruncatedCookies"/><presentation id="ZstdContentEncodingEnabled"/><presentation id="ExperimentationAndConfigurationServiceControl"><dropdownList refId="ExperimentationAndConfigurationServiceControl">Contrôler la communication avec le service d’expérimentation et de configuration</dropdownList></presentation><presentation id="ForcePermissionPolicyUnloadDefaultEnabled"/><presentation id="HttpAllowlist"><listBox refId="HttpAllowlistDesc">Liste verte HTTP</listBox></presentation><presentation id="NewBaseUrlInheritanceBehaviorAllowed"/><presentation id="NewPDFReaderWebView2List"><listBox refId="NewPDFReaderWebView2ListDesc">Définissez le nom de la valeur sur l’ID du modèle utilisateur de l’application ou le nom du fichier exécutable. Vous pouvez utiliser le caractère générique « * » comme nom de valeur à appliquer à toutes les applications.</listBox></presentation><presentation id="RSAKeyUsageForLocalAnchorsEnabled"/></presentationTable></resources></policyDefinitionResources>